{
    "intents": [
        {
            "tag": "chào_hỏi",
            "patterns": [
                "Xin chào",
                "Bạn có khỏe không?",
                "Có ai đó ở đó không?",
                "Xin chào",
                "Ngày tốt lành",
                "Có gì mới không?",
                "Xin chào",
                "Chào bạn"
            ],
            "responses": [
                "Xin chào! Tôi có thể giúp gì bạn về nhu cầu tuyển dụng của bạn?",
                "Vui được gặp bạn lại! Làm thế nào tôi có thể giúp bạn tìm ứng viên hoàn hảo?",
                "Xin chào bạn, hôm nay tôi có thể giúp gì bạn?"
            ],
            "context_set": ""
        },
        {
            "tag": "giới_thiệu",
            "patterns": [
                "Bạn là ai?",
                "Cho tôi viết vài điều về bạn?",
                "Bạn có thể tự giới thiệu bản thân không?",
                "Bạn được tạo ra với mục đích gì?",
                "Tôi đang trò chuyện với ai?",
                "Bạn là gì?",
                "Tôi muốn biết thông tin về bạn",
                "Giới thiệu về bản thân đi",
                "Tôi đang tương tác với một trợ lý ảo",
                "Trình bày một số thông tin về bản thân của bạn"
            ],
            "responses": [
                "Tôi là Panda, trợ lý ảo được tạo ra để hỗ trợ bạn giải đáp thắc mắc về Job panda, hãy hỏi tôi bất cứ gì về trang web tuyển dụng của chúng tôi.",
                "Xin chào! Tôi là trợ lý ảo Panda. Nhiệm vụ của tôi là giúp bạn tìm hiểu và sử dụng dịch vụ của Job Panda . Có gì tôi có thể giúp bạn?",
                "Chào bạn! Tôi là Panda, một trợ lý ảo được phát triển để cung cấp thông tin và hỗ trợ về Job Panda . Bạn có câu hỏi gì về trang web tuyển dụng của chúng tôi không?",
                "Tôi là một trợ lý ảo có tên là Panda, được tạo ra để hỗ trợ người dùng với các thắc mắc liên quan đến Job Panda . Hãy đặt câu hỏi của bạn và tôi sẽ cố gắng giúp bạn!",
                "Xin chào! Tôi là Panda, trợ lý ảo của Job Panda . Tôi có thể giúp bạn với bất kỳ câu hỏi hoặc vấn đề nào liên quan đến trang web tuyển dụng của chúng tôi."
            ],
            "context_set": ""
        },

        {
            "tag": "tạm_biệt",
            "patterns": [
                "Tạm biệt",
                "Hẹn gặp lại bạn sau",
                "Chào tạm biệt",
                "Tôi sẽ đi",
                "Chúc một ngày tốt lành",
                "Tạm biệt",
                "Hẹn gặp lại"
            ],
            "responses": [
                "Buồn khi phải thấy bạn ra đi. Nếu bạn cần hỗ trợ thêm, đừng ngần ngại hỏi!",
                "Chúc gặp lại bạn sau! Đừng ngần ngại quay lại nếu bạn có thêm câu hỏi.",
                "Tạm biệt! Chúc bạn một ngày tốt lành!"
            ],
            "context_set": ""
        },
        {
            "tag": "cơ_hội_việc_làm",
            "patterns": [
                "Có cơ hội việc làm không?",
                "Bạn có các vị trí còn trống không?",
                "Có những cơ hội việc làm nào?",
                "Bạn có thể cho tôi biết về các vị trí trống hiện có không?"
            ],
            "responses": [
                "Có, chúng tôi có một số cơ hội việc làm hấp dẫn hiện có. Bạn có thể chỉ rõ lĩnh vực quan tâm của bạn không?",
                "Chắc chắn! Hiện tại, chúng tôi có nhiều cơ hội việc làm trên các bộ phận khác nhau. Bạn đang tìm kiếm loại vai trò nào?",
                "Có, chúng tôi luôn chào đón các ứng viên có tài năng. Bạn muốn biết thêm về các vị trí cụ thể không?",
                "Đúng vậy! Chúng tôi đang tìm kiếm những người tài năng như bạn để tham gia vào đội ngũ của chúng tôi. Bạn muốn biết thêm chi tiết về các vị trí hiện có không?"
            ],
            "context_set": ""
        },
        
        {
            "tag": "quy_trình_ứng_tuyển",
            "patterns": [
                "Làm thế nào để tôi ứng tuyển vào một công việc?",
                "Quy trình ứng tuyển là gì?",
                "Tôi phải nộp đơn ứng tuyển như thế nào?",
                "Bạn có thể hướng dẫn tôi qua quy trình ứng tuyển được không?"
            ],
            "responses": [
                "Để ứng tuyển vào một công việc, bạn có thể truy cập trang tuyển dụng của chúng tôi trên trang web và nộp đơn trực tuyến. Nếu bạn cần hỗ trợ thêm, đừng ngần ngại hỏi!"
            ],
            "context_set": ""
        },

        {
            "tag": "quy_trình_phỏng_vấn",
            "patterns": [
                "Quy trình phỏng vấn như thế nào?",
                "Làm thế nào quy trình phỏng vấn hoạt động?",
                "Bạn có thể giải thích các giai đoạn phỏng vấn được không?",
                "Tôi nên mong đợi điều gì trong quá trình phỏng vấn?"
            ],
            "responses": [
                "Quy trình phỏng vấn của chúng tôi thường bao gồm nhiều giai đoạn, bao gồm sàng lọc ban đầu, phỏng vấn kỹ thuật và cuộc thảo luận cuối cùng. Mỗi giai đoạn nhằm mục đích đánh giá kỹ năng và phù hợp của bạn với vai trò. Nếu bạn có câu hỏi cụ thể về quy trình phỏng vấn cho một vai trò cụ thể, đừng ngần ngại hỏi!"
            ],
            "context_set": ""
        },
        {
            "tag": "sàng_lọc_hồ_sơ",
            "patterns": [
                "Sàng lọc hồ sơ là gì?",
                "Sàng lọc hồ sơ được xác định như thế nào?",
                "Bạn có thể giải thích về sàng lọc hồ sơ được không?",
                "Mục đích của sàng lọc hồ sơ là gì?",
                "Trong sàng lọc hồ sơ có gì?",
                "Quá trình sàng lọc hồ sơ là gì?",
                "Bạn có thể mô tả về sàng lọc hồ sơ được không?",
                "Sàng lọc hồ sơ được thực hiện như thế nào?",
                "Các khía cạnh chính của sàng lọc hồ sơ là gì?",
                "Bạn có thể cung cấp một tổng quan về sàng lọc hồ sơ không?"
            ],
            "responses": [
                "Sàng lọc hồ sơ là bước ban đầu trong quá trình tuyển dụng, nơi hồ sơ ứng viên được đánh giá để định đoạt sự phù hợp của họ với một vị trí công việc. Quá trình này bao gồm đánh giá CV, thư xin việc và các tài liệu đăng ký khác để xác định liệu ứng viên có đáp ứng các yêu cầu và điều kiện cơ bản cho công việc không. Mục đích của sàng lọc hồ sơ là nhận dạng những ứng viên có trình độ phù hợp nhất để tiến hành vào giai đoạn tiếp theo của quá trình tuyển dụng. Quá trình này thường bao gồm xem xét về trình độ, kỹ năng, kinh nghiệm và tiêu chí công việc liên quan được mô tả trong mô tả công việc. Các khía cạnh chính của sàng lọc hồ sơ bao gồm sự chú ý đến chi tiết, sự nhất quán trong đánh giá và tuân thủ các tiêu chí sàng lọc đã được thiết lập."
            ],
            "context_set": ""
        },
        {
            "tag": "phỏng_vấn_kỹ_thuật",
            "patterns": [
                "Bạn có thể giải thích về phỏng vấn kỹ thuật không?",
                "Làm thế nào bạn xác định phỏng vấn kỹ thuật?",
                "Mục đích của việc tiến hành phỏng vấn kỹ thuật là gì?",
                "Bạn có thể cung cấp một tổng quan về phỏng vấn kỹ thuật không?",
                "Khái niệm 'phỏng vấn kỹ thuật' bao gồm những gì?",
                "Trong phỏng vấn kỹ thuật có gì?",
                "Bạn có thể mô tả về khái niệm phỏng vấn kỹ thuật không?",
                "Phỏng vấn kỹ thuật thường được tiến hành như thế nào?",
                "Các khía cạnh chính của phỏng vấn kỹ thuật là gì?",
                "Phỏng vấn kỹ thuật có ý nghĩa gì trong quá trình tuyển dụng?"
            ],
            "responses": [
                "Phỏng vấn kỹ thuật là một loại phỏng vấn công việc được thiết kế để đánh giá kỹ năng kỹ thuật, kiến thức và khả năng giải quyết vấn đề của ứng viên liên quan đến vai trò công việc hoặc ngành công nghiệp cụ thể. Những cuộc phỏng vấn này thường tập trung vào đánh giá khả năng thành thạo của ứng viên về các khái niệm kỹ thuật, ngôn ngữ lập trình, thuật toán, cấu trúc dữ liệu, thiết kế hệ thống và các lĩnh vực liên quan khác. Mục đích của việc tiến hành phỏng vấn kỹ thuật là xác định sự phù hợp của ứng viên với công việc và đánh giá khả năng của họ trong việc thực hiện các nhiệm vụ yêu cầu trong vai trò. Phỏng vấn kỹ thuật thường bao gồm bài tập lập trình, thách thức trên bảng trắng, trường hợp thực hành hoặc thảo luận về các dự án và kinh nghiệm trước đây. Các khía cạnh chính của phỏng vấn kỹ thuật bao gồm đánh giá kỹ năng giải quyết vấn đề, khả năng giao tiếp, tính linh hoạt và phù hợp với văn hóa của tổ chức. Phỏng vấn kỹ thuật đóng vai trò quan trọng trong quá trình tuyển dụng vì chúng giúp nhà tuyển dụng xác định ứng viên nào sở hữu những kỹ năng kỹ thuật và chuyên môn cần thiết để thành công trong công việc."
            ],
            "context_set": ""
        },
        {
            "tag": "tạo_cv",
            "patterns": [
                "Quy trình tạo CV trên trang web của bạn là gì?",
                "Bạn có thể giải thích cách tạo CV bằng cách sử dụng trang web của bạn không?",
                "Tôi cần tuân theo những bước nào để tạo CV trên trang web của bạn?",
                "Bạn có thể cung cấp hướng dẫn về cách tạo CV trên trang web của bạn không?",
                "Tôi có thể làm thế nào để tạo CV trên trang web của bạn?",
                "Những hướng dẫn nào được cung cấp cho việc tạo CV trên trang web của bạn?",
                "Bạn có thể hướng dẫn tôi qua quy trình tạo CV trên trang web của bạn không?",
                "Những tính năng hoặc công cụ nào có sẵn để tạo CV trên trang web của bạn?",
                "Bạn có tài nguyên hoặc hướng dẫn nào để tạo CV trên trang web của bạn không?",
                "Có một phần cụ thể nào trên trang web của bạn dành cho việc tạo CV không?"
            ],
            "responses": [
                "Để tạo CV trên trang web của chúng tôi, bạn có thể thực hiện các bước sau:\n\n1. Đăng nhập vào tài khoản của bạn hoặc tạo tài khoản mới nếu bạn chưa có.\n2. Truy cập mục 'Hồ sơ và Sự nghiệp > Sơ yếu lý lịch' trên trang web của chúng tôi.\n3. Bắt đầu bằng cách nhập thông tin cá nhân như tên, thông tin liên hệ và địa chỉ.\n4. Tiếp tục thêm thông tin về học vấn, bao gồm bằng cấp, chứng chỉ và các khóa học liên quan.\n5. Cung cấp thông tin về kinh nghiệm làm việc của bạn, bao gồm chức danh công việc, công ty và trách nhiệm.\n6. Tuỳ chọn, bao gồm các phần về kỹ năng, thành tích, giải thưởng và người tham khảo.\n7. Khi bạn đã nhập đủ thông tin cần thiết, hãy xem xét và chỉnh sửa CV của bạn nếu cần thiết.\n8. Lưu lại CV của bạn và chọn xem trước để xem lại.\n\n Cuối cùng, bạn có thể xuất PDF CV của mình."
            ],
            "context_set": ""
        },

        {
            "tag": "thông_tin_liên_hệ",
            "patterns": [
                "Làm thế nào để liên hệ với trang web jobpanda nếu tôi có vấn đề?",
                "Có phương tiện liên hệ nào khác ngoài email mà tôi có thể sử dụng để liên lạc với bạn không?",
                "Bạn có số điện thoại liên lạc nào mà tôi có thể gọi không?",
                "Nếu tôi muốn gặp một nhân viên mặt đối diện, tôi nên làm gì?",
                "Trang web jobpanda có cung cấp dịch vụ hỗ trợ trực tuyến không?",
                "Có dịch vụ hỗ trợ khẩn cấp nào không?"
            ],
            "responses": [
                "Bạn có thể liên hệ với trang web jobpanda thông qua email: nguyenkhanh2kpi@gmail.com và số điện thoại: 0349519943. Nếu bạn muốn gặp mặt trực tiếp, vui lòng đến địa chỉ 1 Võ Văn Ngân, Thủ Đức.",
                "Để liên hệ với trang web jobpanda, bạn có thể sử dụng email: nguyenkhanh2kpi@gmail.com hoặc gọi điện thoại đến số 0349519943. Chúng tôi cũng có dịch vụ hỗ trợ trực tuyến và hỗ trợ khẩn cấp nếu cần.",
                "Trang web jobpanda có thể được liên hệ qua email: nguyenkhanh2kpi@gmail.com hoặc số điện thoại: 0349519943. Nếu bạn muốn gặp mặt, hãy đến văn phòng chúng tôi tại địa chỉ 1 Võ Văn Ngân, Thủ Đức.",
                "Nếu bạn cần liên hệ với trang web jobpanda, bạn có thể gửi email hoặc gọi điện thoại đến số 0349519943. Để gặp mặt trực tiếp, vui lòng đến văn phòng tại 1 Võ Văn Ngân, Thủ Đức.",
                "Liên hệ với trang web jobpanda có thể qua email hoặc số điện thoại. Nếu bạn muốn gặp mặt, hãy đến văn phòng tại địa chỉ 1 Võ Văn Ngân, Thủ Đức.",
                "Để liên hệ với trang web jobpanda, bạn có thể sử dụng email hoặc gọi điện thoại. Nếu cần hỗ trợ trực tuyến hoặc khẩn cấp, vui lòng liên hệ qua email: nguyenkhanh2kpi@gmail.com hoặc gọi đến số 0349519943."
            ],
            "context_set": ""
        },
        
        {
            "tag": "thông_tin_vị_trí",
            "patterns": [
                "Công ty của bạn đặt ở đâu?",
                "Công ty của bạn có thể được tìm thấy ở đâu?",
                "Công ty của bạn nằm ở đâu?",
                "Vị trí của công ty của bạn là gì?",
                "Vị trí địa lý của công ty của bạn là gì?",
                "Công ty của bạn đặt ở khu vực nào?",
                "Ở đâu là nơi của công ty của bạn?",
                "Địa chỉ của công ty của bạn là gì?",
                "Công ty của bạn nằm ở thành phố nào?"
            ],
            "responses": [
                "Công ty của chúng tôi đặt tại số 1 Võ Văn Ngân, Thủ Đức.",
                "Bạn có thể tìm thấy công ty của chúng tôi tại địa chỉ số 1 Võ Văn Ngân, Thủ Đức.",
                "Vị trí của công ty chúng tôi là số 1 Võ Văn Ngân, Thủ Đức.",
                "Công ty của chúng tôi nằm ở số 1 Võ Văn Ngân, Thủ Đức.",
                "Địa chỉ của công ty của chúng tôi là số 1 Võ Văn Ngân, Thủ Đức.",
                "Công ty của chúng tôi nằm ở thành phố Thủ Đức, địa chỉ là số 1 Võ Văn Ngân."
            ],
            "context_set": ""
        },

        {
            "tag": "nhận_thông_báo_phỏng_vấn",
            "patterns": [
                "Làm sao để tôi biết khi nào tôi được phỏng vấn?",
                "Tôi sẽ nhận được thông báo phỏng vấn qua phương tiện nào?",
                "Khi nào tôi có thể mong đợi nhận được thông báo về kết quả phỏng vấn?",
                "Nếu tôi không nhận được email thông báo về phỏng vấn, tôi nên làm gì?",
                "Có thời gian cụ thể nào để nhận thông báo về kết quả phỏng vấn sau khi gửi CV?",
                "Tôi có thể liên hệ trực tiếp với nhà tuyển dụng để biết về kết quả phỏng vấn không?"
            ],
            "responses": [
                "Thông thường, nhà tuyển dụng sẽ gửi email thông báo cho bạn khi bạn được chọn cho một cuộc phỏng vấn. Hãy kiểm tra hòm thư đến và hòm thư rác của bạn thường xuyên để không bỏ lỡ thông báo.",
                "Thời gian chính xác để nhận được thông báo có thể thay đổi tùy thuộc vào quy trình của từng công ty. Thông thường, bạn có thể mong đợi nhận được thông báo trong vài ngày hoặc vài tuần sau khi gửi CV.",
                "Nếu sau một khoảng thời gian bạn vẫn chưa nhận được email thông báo về phỏng vấn, hãy kiểm tra lại email của bạn và đảm bảo rằng bạn đã kiểm tra cả hòm thư rác. Nếu vẫn không có, bạn có thể xem xét việc liên hệ trực tiếp với nhà tuyển dụng để yêu cầu cập nhật về tình hình của bạn.",
                "Thời gian để nhận được thông báo về kết quả phỏng vấn có thể khác nhau tùy thuộc vào quy trình của từng công ty. Một số công ty có thể thông báo ngay sau khi quyết định được đưa ra, trong khi các công ty khác có thể mất một thời gian dài hơn để xem xét và quyết định.",
                "Thông thường, việc liên hệ trực tiếp với nhà tuyển dụng để biết về kết quả phỏng vấn không được khuyến khích. Thay vào đó, hãy chờ đợi thông báo chính thức từ nhà tuyển dụng qua email."
            ],
            "context_set": ""
        },

        
        {
            "tag": "tạo_role_nhà_tuyển_dụng",
            "patterns": [
                "Làm thế nào để đăng ký tài khoản nhà tuyển dụng?",
                "Tôi cần làm gì để tạo tài khoản nhà tuyển dụng?",
                "Có cách nào để đăng ký tài khoản nhà tuyển dụng không?",
                "Tôi muốn đăng ký làm nhà tuyển dụng, làm thế nào để bắt đầu?",
                "Bạn có thể hướng dẫn tôi tạo tài khoản nhà tuyển dụng không?"
            ],
            "responses": [
                "Để đăng ký tài khoản nhà tuyển dụng, hãy liên hệ với chúng tôi qua email: nguyenkhanh2kpi@gmail.com để xác minh thông tin về công ty của bạn và yêu cầu tạo tài khoản. Sau khi thông tin của bạn được xác minh, chúng tôi sẽ tạo tài khoản nhà tuyển dụng cho bạn và bạn có thể bắt đầu tìm kiếm ứng viên phù hợp cho vị trí công việc của mình.",
                "Quá trình đăng ký tài khoản nhà tuyển dụng rất đơn giản. Bạn chỉ cần gửi email đến địa chỉ nguyenkhanh2kpi@gmail.com và cung cấp thông tin về công ty của bạn. Chúng tôi sẽ xác minh thông tin đó và tạo tài khoản nhà tuyển dụng cho bạn.",
                "Bạn có thể bắt đầu quá trình đăng ký tài khoản nhà tuyển dụng bằng cách gửi email tới nguyenkhanh2kpi@gmail.com. Chúng tôi sẽ cung cấp hướng dẫn chi tiết về quy trình và yêu cầu thông tin cần thiết từ bạn để hoàn tất quá trình đăng ký.",
                "Để đăng ký tài khoản nhà tuyển dụng, bạn chỉ cần gửi email yêu cầu đến địa chỉ nguyenkhanh2kpi@gmail.com và cung cấp thông tin về công ty của bạn. Chúng tôi sẽ xác minh thông tin và tạo tài khoản cho bạn trong thời gian sớm nhất.",
                "Quá trình đăng ký tài khoản nhà tuyển dụng rất dễ dàng. Bạn chỉ cần liên hệ với chúng tôi qua email nguyenkhanh2kpi@gmail.com và chúng tôi sẽ hướng dẫn bạn qua từng bước để hoàn tất quá trình đăng ký."
            ],
            "context_set": ""
        },
                    
        {
            "tag": "gợi_ý_việc_làm",
            "patterns": [
                "Bạn có thể gợi ý vài công việc cho tôi không?",
                "Tôi cần một số gợi ý về các công việc phù hợp với mình.",
                "Tôi muốn tìm hiểu về các công việc có sẵn. Bạn có thể giúp tôi không?",
                "Tôi đang tìm kiếm một số công việc mới. Bạn có thể đề xuất một vài không?",
                "Có công việc nào phù hợp với tôi không? Bạn có thể gợi ý không?"
            ],
            "responses": [
                "Dưới đây là vài công việc tôi nghĩ sẽ phù hợp với bạn:"
            ],
            "context_set": ""
        }
        
    ]
}
